Config/Documents/НачислениеРезервовПоОтпускам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>НачислениеРезервовПоОтпускам</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ОперацииКапвложений</xr:Item>
				<xr:Item>AccountingRegister.ЖурналПроводокЕПСБУ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорректировкаОбязательств</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмпортированИзЗГУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДИсточника</Name>
					<Comment>Хранит идентификатор объекта источника при переносе данных из другой системы (например БГУ1)</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПервичногоДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерПервичногоДокумента</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОценочныеОбязательства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособОтраженияЗарплатыВУчете</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВБухУчете</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяФинансированияЗарплата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиФинансированияЗарплата</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОперацииПоЗарплате</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыОперацийПоЗарплате</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КЭК</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетНУ</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоНУ1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоНУ2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоНУ3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОблагаетсяЕНВД</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтражениеВУчете</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтражениеВУчетеЗаполнено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтражениеВУчетеДоступность</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтразитьВКарточкеКапвложений</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КарточкаКапвложений</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КарточкиКапвложений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопКлассификация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДополнительнаяБюджетнаяКлассификация</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодМероприятия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодЦели</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦелевыхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/InformationRegisters/НастройкаСпособовОтраженияЗарплатыВБухУчете.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкаСпособовОтраженияЗарплатыВБухУчете</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СчетДт</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Субконто1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Субконто2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Субконто3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетНУ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоНУ1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоНУ2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоНУ3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтражениеВУСН</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОтражениеВУСН</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеИспользоватьВходящиеДанныеЗГУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодЦели</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦелевыхСредств</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодМероприятия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопКлассификация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительнаяБюджетнаяКлассификация</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СпособОтраженияЗарплатыВБухУчете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВБухУчете</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоЗарплате</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодНалоговогоОргана</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/НастройкаСтатейФинансированияЗарплата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкаСтатейФинансированияЗарплата</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КФО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтатьяФинансированияЗарплата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиФинансированияЗарплата</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоЗарплате</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КЭК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Documents/НачислениеРезервовПоОтпускам/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ДополнитьДанныеТабличнойЧасти() Экспорт
	
	Запрос = Новый Запрос;                                    
	Запрос.УстановитьПараметр("НаДату", Дата);
	Запрос.Текст = "ВЫБРАТЬ
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчетеСрезПоследних.СпособОтраженияЗарплатыВБухУчете КАК СпособОтражения,
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчетеСрезПоследних.Организация КАК Организация,
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчетеСрезПоследних.ВидОперации КАК ВидОперацииЗГУ,
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчетеСрезПоследних.СчетДт КАК Счет,
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчетеСрезПоследних.Субконто1 КАК Субконто1,
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчетеСрезПоследних.Субконто2 КАК Субконто2,
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчетеСрезПоследних.Субконто3 КАК Субконто3,
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчетеСрезПоследних.СчетНУ КАК СчетНУ,
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчетеСрезПоследних.СубконтоНУ1 КАК СубконтоНУ1,
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчетеСрезПоследних.СубконтоНУ2 КАК СубконтоНУ2,
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчетеСрезПоследних.СубконтоНУ3 КАК СубконтоНУ3,
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчетеСрезПоследних.КодЦели КАК КодЦели,
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчетеСрезПоследних.КодМероприятия КАК КодМероприятия,
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчетеСрезПоследних.ДопКлассификация КАК ДопКлассификация
	               |ИЗ
	               |	РегистрСведений.НастройкаСпособовОтраженияЗарплатыВБухУчете.СрезПоследних(&НаДату, ) КАК НастройкаСпособовОтраженияЗарплатыВБухУчетеСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НастройкаСтатейФинансированияЗарплатаСрезПоследних.СтатьяФинансированияЗарплата КАК СтатьяФинансированияЗГУ,
	               |	НастройкаСтатейФинансированияЗарплатаСрезПоследних.Организация КАК Организация,
	               |	НастройкаСтатейФинансированияЗарплатаСрезПоследних.ВидОперации КАК ВидОперацииЗГУ,
	               |	НастройкаСтатейФинансированияЗарплатаСрезПоследних.КЭК КАК КЭКСтатьи,
	               |	НастройкаСтатейФинансированияЗарплатаСрезПоследних.ИФО КАК ИФО,
	               |	НастройкаСтатейФинансированияЗарплатаСрезПоследних.КФО КАК КФО,
	               |	НастройкаСтатейФинансированияЗарплатаСрезПоследних.КПС КАК КПС
	               |ИЗ
	               |	РегистрСведений.НастройкаСтатейФинансированияЗарплата.СрезПоследних(&НаДату, ) КАК НастройкаСтатейФинансированияЗарплатаСрезПоследних";
					   
	Результат = Запрос.ВыполнитьПакет();
	
	НастройкаСпОтр = Результат[0].Выгрузить();
	НастройкаСпОтр.Индексы.Добавить("СпособОтражения,Организация,ВидОперацииЗГУ");
	
	НастройкаСтФин = Результат[1].Выгрузить();
	НастройкаСтФин.Индексы.Добавить("СтатьяФинансированияЗГУ,Организация,ВидОперацииЗГУ,КЭКСтатьи");			   

	Для Каждого СтрокаТаблицы Из ОценочныеОбязательства Цикл
		Если СтрокаТаблицы.ВидОперацииПоЗарплате = Перечисления.ВидыОперацийПоЗарплате.ОценкаОбязательстваИФормированиеРезервов Тогда
			СтрокаТаблицы.КЭК = Справочники.КОСГУ.НайтиПоКоду("211");
		ИначеЕсли СтрокаТаблицы.ВидОперацииПоЗарплате = Перечисления.ВидыОперацийПоЗарплате.ФССОценочныеОбязательства
			ИЛИ СтрокаТаблицы.ВидОперацииПоЗарплате = Перечисления.ВидыОперацийПоЗарплате.ФССНСОценочныеОбязательства
			ИЛИ СтрокаТаблицы.ВидОперацииПоЗарплате = Перечисления.ВидыОперацийПоЗарплате.ФСС
			ИЛИ СтрокаТаблицы.ВидОперацииПоЗарплате = Перечисления.ВидыОперацийПоЗарплате.ФССНС
			ИЛИ СтрокаТаблицы.ВидОперацииПоЗарплате = Перечисления.ВидыОперацийПоЗарплате.СтраховыеВзносыРезервы
			ИЛИ СтрокаТаблицы.ВидОперацииПоЗарплате = Перечисления.ВидыОперацийПоЗарплате.ФССНСРезервы Тогда
			СтрокаТаблицы.КЭК = Справочники.КОСГУ.НайтиПоКоду("213");
		КонецЕсли;		
		
		СтруктураОтбораСпОтр = Новый Структура;
		СтруктураОтбораСпОтр.Вставить("СпособОтражения", СтрокаТаблицы.СпособОтраженияЗарплатыВУчете);
		СтруктураОтбораСпОтр.Вставить("Организация", Организация);
		СтруктураОтбораСпОтр.Вставить("ВидОперацииЗГУ", СтрокаТаблицы.ВидОперацииПоЗарплате);
		                                                     
		СтрокаСпОтр = НастройкаСпОтр.НайтиСтроки(СтруктураОтбораСпОтр);

		Если СтрокаСпОтр.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаСпОтр[0]);
		КонецЕсли;
		
		СтруктураОтбораСтФин = Новый Структура;
		СтруктураОтбораСтФин.Вставить("СтатьяФинансированияЗГУ",СтрокаТаблицы.СтатьяФинансированияЗарплата);
		СтруктураОтбораСтФин.Вставить("Организация", Организация);
		СтруктураОтбораСтФин.Вставить("ВидОперацииЗГУ", СтрокаТаблицы.ВидОперацииПоЗарплате);
		СтруктураОтбораСтФин.Вставить("КЭКСтатьи", СтрокаТаблицы.КЭК);
		
		СтрокаСтФин = НастройкаСтФин.НайтиСтроки(СтруктураОтбораСтФин);
					
		Если СтрокаСтФин.Количество() = 0 Тогда
			СтруктураОтбораСтФин.КЭКСтатьи = Справочники.КОСГУ.ПустаяСсылка();
			СтрокаСтФин = НастройкаСтФин.НайтиСтроки(СтруктураОтбораСтФин);
		КонецЕсли;
		
		Если СтрокаСтФин.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаСтФин[0]);
		КонецЕсли;
	
	КонецЦикла;
	
	УчетПоПодразделениям = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям");
	УчетПоИФО = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО");
	
	Если Не УчетПоПодразделениям Или Не УчетПоИФО Тогда
		КолонкиГруппировки = "Подразделение,ИФО,
			               |СпособОтраженияЗарплатыВУчете,
			               |СтатьяФинансированияЗарплата,
			               |ВидОперацииПоЗарплате,
			               |КФО,
			               |КПС,
			               |КЭК,
			               |Счет,
			               |Субконто1,
			               |Субконто2,
			               |Субконто3,
			               |СчетНУ,
			               |СубконтоНУ1,
			               |СубконтоНУ2,
			               |СубконтоНУ3,
			               |ОблагаетсяЕНВД,
			               |КодЦели,
			               |КодМероприятия,
			               |ДопКлассификация";
		
		Если Не УчетПоПодразделениям Тогда
			КолонкиГруппировки = СтрЗаменить(КолонкиГруппировки, "Подразделение,", "");
		КонецЕсли;
		
		Если Не УчетПоИФО Тогда
			КолонкиГруппировки = СтрЗаменить(КолонкиГруппировки, "ИФО,", "");
		КонецЕсли;
			
		ОценочныеОбязательства.Свернуть(КолонкиГруппировки, "Сумма, СуммаНУ");
	КонецЕсли;
	
	ИмпортированИзЗГУ = Истина;
	
	ДополнительныеСвойства.Вставить("ПроцессыОбработкиДокументов_ЗаписатьБезПроверкиИсполнителяЭтапа");
	
	Записать();
	
КонецПроцедуры

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	// Логика ограничения:
	// Чтения:     Организация
	// Изменения:  Организация
	
	// Чтение, Изменение: набор №0.
	Строка = Таблица.Добавить();
	Строка.ЗначениеДоступа = Организация;
	
КонецПроцедуры 

#КонецОбласти
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	СуммаДокумента = ОценочныеОбязательства.Итог("Сумма");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
